In [1]:
import pandas as pd

In [5]:
dict1 = {
    'Name':['Muhammad Ahmed','Muhammad Ali','Muhammad Ramzan','Muhammad Kamran','Ayesha Khan','Hafsa Ali',
            'Fatima Khan','Alisha Ahmed'],
    'Gender':['Male','Male','Male','Male','Female','Female','Female','Female'],
    'Marks':[82,89,75,89,91,76,64,85]
}
df1 = pd.DataFrame(dict1,index=[1,2,3,4,5,6,7,8])
df1

              Name  Gender  Marks
1   Muhammad Ahmed    Male     82
2     Muhammad Ali    Male     89
3  Muhammad Ramzan    Male     75
4  Muhammad Kamran    Male     89
5      Ayesha Khan  Female     91
6        Hafsa Ali  Female     76
7      Fatima Khan  Female     64
8     Alisha Ahmed  Female     85

In [8]:
# 1.Display Top 6 Rows of The Dataset
df1.head(6)

              Name  Gender  Marks
1   Muhammad Ahmed    Male     82
2     Muhammad Ali    Male     89
3  Muhammad Ramzan    Male     75
4  Muhammad Kamran    Male     89
5      Ayesha Khan  Female     91
6        Hafsa Ali  Female     76

In [9]:
# 2. Check Last 4 Rows of The Dataset
df1.tail(4)

           Name  Gender  Marks
5   Ayesha Khan  Female     91
6     Hafsa Ali  Female     76
7   Fatima Khan  Female     64
8  Alisha Ahmed  Female     85

In [12]:
# 3. Find Shape of Our Dataset (Number of Rows And Number of Columns)
df1.shape

(8, 3)

In [13]:
print(f"Total Number Of Rows: ",df1.shape[0])
print(f"Total Number Of Columns: ",df1.shape[1])

Total Number Of Rows:  8
Total Number Of Columns:  3

In [14]:
# 4. Getting Information About Our Dataset Like Total Number Rows,
# Total Number of Columns, Datatypes of Each Column And Memory Requirement

df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 1 to 8
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Gender  8 non-null      object
 2   Marks   8 non-null      int64
dtypes: int64(1), object(2)
memory usage: 256.0+ bytes

In [16]:
# 5. Get Overall Statistics About The Dataframe
df1.describe()

           Marks
count   8.000000
mean   81.375000
std     9.210824
min    64.000000
25%    75.750000
50%    83.500000
75%    89.000000
max    91.000000

In [21]:
df1.describe(include='all')

                  Name Gender      Marks
count                8      8   8.000000
unique               8      2        NaN
top     Muhammad Ahmed   Male        NaN
freq                 1      4        NaN
mean               NaN    NaN  81.375000
std                NaN    NaN   9.210824
min                NaN    NaN  64.000000
25%                NaN    NaN  75.750000
50%                NaN    NaN  83.500000
75%                NaN    NaN  89.000000
max                NaN    NaN  91.000000

In [18]:
# 6.Check Null Values In The Dataset

df1.isnull()

    Name  Gender  Marks
1  False   False  False
2  False   False  False
3  False   False  False
4  False   False  False
5  False   False  False
6  False   False  False
7  False   False  False
8  False   False  False

In [19]:
df1.isnull().sum(axis=0)    # It shows All The Null Values As A Row wise

Name      0
Gender    0
Marks     0
dtype: int64

In [20]:
df1.isnull().sum(axis=1)  # It shows All The Null Values As A Column wise

1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    0
dtype: int64

In [23]:
# 7. Find The Unique Values From Gender Column

df1['Gender'].unique()

array([82, 89, 75, 91, 76, 64, 85], dtype=int64)

In [24]:
# 8. Find The Number Of Unique Values From Gender Column
df1['Gender'].nunique()

2

In [26]:
# 9. Display Count Of Unique Values In Gender Column 
df1['Gender'].value_counts()

Male      4
Female    4
Name: Gender, dtype: int64

In [28]:
# 10. Find Total Numbers Of Students HHaving Marks Between 80 and 100 (Inclusive) Using Between Method

df1['Marks']>=80

1     True
2     True
3    False
4     True
5     True
6    False
7    False
8     True
Name: Marks, dtype: bool

In [32]:
(df1['Marks']>=80)      &  (df1['Marks']<=100)

1     True
2     True
3    False
4     True
5     True
6    False
7    False
8     True
Name: Marks, dtype: bool

In [33]:
df1[(df1['Marks']>=80)      &  (df1['Marks']<=100)]

              Name  Gender  Marks
1   Muhammad Ahmed    Male     82
2     Muhammad Ali    Male     89
4  Muhammad Kamran    Male     89
5      Ayesha Khan  Female     91
8     Alisha Ahmed  Female     85

In [34]:
len(df1[(df1['Marks']>=80)      &  (df1['Marks']<=100)])

5

In [35]:
df1['Marks'].between(80,100)

1     True
2     True
3    False
4     True
5     True
6    False
7    False
8     True
Name: Marks, dtype: bool

In [36]:
sum(df1['Marks'].between(80,100))

5

In [37]:
# Find Average/Min/Max Marks

df1

              Name  Gender  Marks
1   Muhammad Ahmed    Male     82
2     Muhammad Ali    Male     89
3  Muhammad Ramzan    Male     75
4  Muhammad Kamran    Male     89
5      Ayesha Khan  Female     91
6        Hafsa Ali  Female     76
7      Fatima Khan  Female     64
8     Alisha Ahmed  Female     85

In [38]:
df1['Marks'].mean()    # For Average Marks

81.375

In [39]:
df1['Marks'].min()    # For Mininmum Marks

64

In [40]:
df1['Marks'].max()   # For Maximum Marks

91

In [53]:
# Apply Method

def marks(x):
    return x/2

df1['New_Marks']=df1['Marks'].apply(marks) #After Division Marks will be Shown in New_Marks Column

In [52]:
df1

              Name  Gender  Marks  New_Marks
1   Muhammad Ahmed    Male     82       41.0
2     Muhammad Ali    Male     89       44.5
3  Muhammad Ramzan    Male     75       37.5
4  Muhammad Kamran    Male     89       44.5
5      Ayesha Khan  Female     91       45.5
6        Hafsa Ali  Female     76       38.0
7      Fatima Khan  Female     64       32.0
8     Alisha Ahmed  Female     85       42.5

In [54]:
def marks(x):
    return x//2   #It Removes Decimals From Marks_Values 

df1['New_Marks']=df1['Marks'].apply(marks) #After Division Marks will be Shown in New_Marks Column

In [55]:
df1

              Name  Gender  Marks  New_Marks
1   Muhammad Ahmed    Male     82         41
2     Muhammad Ali    Male     89         44
3  Muhammad Ramzan    Male     75         37
4  Muhammad Kamran    Male     89         44
5      Ayesha Khan  Female     91         45
6        Hafsa Ali  Female     76         38
7      Fatima Khan  Female     64         32
8     Alisha Ahmed  Female     85         42

In [60]:
# Applying Lambda Function

df1['Marks'] = df1['Marks'].apply(lambda x:x/2)
df1

              Name  Gender  Marks  New_Marks
1   Muhammad Ahmed    Male  20.50         41
2     Muhammad Ali    Male  22.25         44
3  Muhammad Ramzan    Male  18.75         37
4  Muhammad Kamran    Male  22.25         44
5      Ayesha Khan  Female  22.75         45
6        Hafsa Ali  Female  19.00         38
7      Fatima Khan  Female  16.00         32
8     Alisha Ahmed  Female  21.25         42

In [61]:
# len Function  (It Calculate or Finds The Total Number Of Alphabets In Each Column or Row)

df1['Name'].apply(len)

1    14
2    12
3    15
4    15
5    11
6     9
7    11
8    12
Name: Name, dtype: int64

In [65]:
# Map Function
# Here We Use 1 for Male AND 0 For Femaole

df1['Gender'].map({'Male':1, "Female":0})

1    1
2    1
3    1
4    1
5    0
6    0
7    0
8    0
Name: Gender, dtype: int64

In [67]:
df1['Gender_No']= df1['Gender'].map({'Male':1, "Female":0})
df1

              Name  Gender  Marks  New_Marks  Gender_No
1   Muhammad Ahmed    Male  20.50         41          1
2     Muhammad Ali    Male  22.25         44          1
3  Muhammad Ramzan    Male  18.75         37          1
4  Muhammad Kamran    Male  22.25         44          1
5      Ayesha Khan  Female  22.75         45          0
6        Hafsa Ali  Female  19.00         38          0
7      Fatima Khan  Female  16.00         32          0
8     Alisha Ahmed  Female  21.25         42          0

In [70]:
# Drop Column(s)
# For Single Column

df1.drop('Gender_No',axis=1)

              Name  Gender  Marks  New_Marks
1   Muhammad Ahmed    Male  20.50         41
2     Muhammad Ali    Male  22.25         44
3  Muhammad Ramzan    Male  18.75         37
4  Muhammad Kamran    Male  22.25         44
5      Ayesha Khan  Female  22.75         45
6        Hafsa Ali  Female  19.00         38
7      Fatima Khan  Female  16.00         32
8     Alisha Ahmed  Female  21.25         42

In [72]:
# For Multiple Columns
# We Use Python List For Dropping Multiple Columns

df1.drop(['Gender_No','New_Marks'],axis=1,inplace=True)

              Name  Gender  Marks
1   Muhammad Ahmed    Male  20.50
2     Muhammad Ali    Male  22.25
3  Muhammad Ramzan    Male  18.75
4  Muhammad Kamran    Male  22.25
5      Ayesha Khan  Female  22.75
6        Hafsa Ali  Female  19.00
7      Fatima Khan  Female  16.00
8     Alisha Ahmed  Female  21.25

In [76]:
def marks(x):
    return x+70
df1['Marks']=df1['Marks'].apply(marks)

In [77]:
df1

              Name  Gender   Marks  New_Marks  Gender_No
1   Muhammad Ahmed    Male  160.50         41          1
2     Muhammad Ali    Male  162.25         44          1
3  Muhammad Ramzan    Male  158.75         37          1
4  Muhammad Kamran    Male  162.25         44          1
5      Ayesha Khan  Female  162.75         45          0
6        Hafsa Ali  Female  159.00         38          0
7      Fatima Khan  Female  156.00         32          0
8     Alisha Ahmed  Female  161.25         42          0

In [79]:
df1

              Name  Gender   Marks  New_Marks  Gender_No
1   Muhammad Ahmed    Male  160.50         41          1
2     Muhammad Ali    Male  162.25         44          1
3  Muhammad Ramzan    Male  158.75         37          1
4  Muhammad Kamran    Male  162.25         44          1
5      Ayesha Khan  Female  162.75         45          0
6        Hafsa Ali  Female  159.00         38          0
7      Fatima Khan  Female  156.00         32          0
8     Alisha Ahmed  Female  161.25         42          0

In [81]:
df1.drop(['New_Marks','Gender_No'],axis=1,inplace=True)

In [82]:
df1

              Name  Gender   Marks
1   Muhammad Ahmed    Male  160.50
2     Muhammad Ali    Male  162.25
3  Muhammad Ramzan    Male  158.75
4  Muhammad Kamran    Male  162.25
5      Ayesha Khan  Female  162.75
6        Hafsa Ali  Female  159.00
7      Fatima Khan  Female  156.00
8     Alisha Ahmed  Female  161.25

In [86]:
# Print Name Of The Columns

df1.columns

Index(['Name', 'Gender', 'Marks'], dtype='object')

In [88]:
# Print Indexes

df1.index

Int64Index([1, 2, 3, 4, 5, 6, 7, 8], dtype='int64')

In [89]:
# Sort Dataset As per The Marks Columns


df1.sort_values('Marks')     # By Default Descending Order

              Name  Gender   Marks
7      Fatima Khan  Female  156.00
3  Muhammad Ramzan    Male  158.75
6        Hafsa Ali  Female  159.00
1   Muhammad Ahmed    Male  160.50
8     Alisha Ahmed  Female  161.25
2     Muhammad Ali    Male  162.25
4  Muhammad Kamran    Male  162.25
5      Ayesha Khan  Female  162.75

In [90]:
df1.sort_values(['Marks', 'Gender'], ascending=False)  #Sorting Multiple Columns Via Ascending Order

              Name  Gender   Marks
5      Ayesha Khan  Female  162.75
2     Muhammad Ali    Male  162.25
4  Muhammad Kamran    Male  162.25
8     Alisha Ahmed  Female  161.25
1   Muhammad Ahmed    Male  160.50
6        Hafsa Ali  Female  159.00
3  Muhammad Ramzan    Male  158.75
7      Fatima Khan  Female  156.00

In [91]:
# Display NAME And Marks Of Females Student

df1[df1['Gender'] == 'Female'] [['Name','Marks']]

           Name   Marks
5   Ayesha Khan  162.75
6     Hafsa Ali  159.00
7   Fatima Khan  156.00
8  Alisha Ahmed  161.25

In [92]:
df1['Gender'].isin(['Female'])

1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
Name: Gender, dtype: bool

In [93]:
df1[df1['Gender'].isin(['Female'])]

           Name  Gender   Marks
5   Ayesha Khan  Female  162.75
6     Hafsa Ali  Female  159.00
7   Fatima Khan  Female  156.00
8  Alisha Ahmed  Female  161.25

In [95]:
df1[df1['Gender'].isin(['Female'])] [['Name','Marks']]

           Name   Marks
5   Ayesha Khan  162.75
6     Hafsa Ali  159.00
7   Fatima Khan  156.00
8  Alisha Ahmed  161.25